[
  {
    "id": "1",
    "title": "Portfolio",
    "date": "Mars 2025",
    "picture": "/images/projet-portofolio.webp",
    "description": "Créer et développer mon portfolio de développeur",
    "langages": ["React", "JavaScript", "Sass", "Next", "Bootstrap", "Html/Css"],
    "lien": "https://github.com/kahina92-hash/portofolio.git",
    "demo": "https://kahina92-hash.github.io/portofolio/",
    "images": [
      "/images/acceuil-portofolio.webp",
      "/images/contact-portofolio.webp",
      "/images/projets-portofolio.webp"
    ],
    "Compétences_acquises":[ "Créer un site fullStak Avec Next.js", "Acheter un nom de domaine et déployer mon site en ligne",
  " Exécuter des requêtes postgreSQL pour ajouter et récupérer des données"
  ],
    "context":"La mission de ce projet est la création et la publication en ligne de mon propre portfolio de développeur, me permettant de présenter mon parcours, mes compétences et tous mes projets que j'ai pu réaliser de manière professionnelle."
  },
  {
    "id": "2",
    "title": "Argent Bank",
    "date": "Février 2025",
    "picture": "/images/booki.webp",
    "description": "Un projet bancaire innovant",
    "langages": ["React", "Node.js", "MongoDB", "Sass", "Html/Css", "Redux"],
    "lien": "https://github.com/Kahina24D/ArgentBank-Frontend.git",
    "images": [
      "/images/argent-bank1.webp",
      "/images/argent-bank2.webp",
       "/images/argent-bank3.webp"
    ],
    "Compétences_acquises":[ " Afficher les données du backend sur l'interface via des appels API", "Configurer des routes API pour la communication client / serveur",
    "  Découverte de Swagger pour documenter et décrire les différentes routes et actions nécessaires pour l'API"
    ],
      "context":"Argent Bank est une nouvelle banque en ligne qui souhaite percer dans le secteur bancaire. La première mission de ce projet est le développement front-end d'une application bancaire en utilisant React et Redux pour créer une expérience utilisateur dynamique et réactive via des appels à l'API REST. La seconde mission est d'utiliser Swagger pour définir les points d'accès de l'API et modéliser les interactions avec les données des transactions."
    },
  {
    "id": "3",
    "title": "Menu Maker",
    "date": "Janvier 2025",
    "picture": "/images/projet-qwenta.png",
    "description": "Planifier le développement d'un site web",
    "langages": ["Agile", "Kanban", "Notion"],
    "lien": "https://github.com/kahina92-hash/Menu-Marker.git",
    "images": [
      "/images/qwenta1.webp",
      "/images/qwenta2.webp",
       "/images/qwenta3.webp"
    ],
    "Compétences_acquises":[ " Découper une fonctionnalité en tâches pour préparer le développement", "Mettre en place une méthode de veille technologique via l'outil Pearltrees",
    "  Découvrir les méthodes de gestion de projet Agile","Créer le tableau Kanban pour suivre le déroulement du projet grâce à un outil de gestion de projet - Notion"
    ],
      "context":"Menu Maker by QWENTA” est un site permettant aux restaurateurs d'afficher et de mettre en page leurs menus facilement, en quelques clics. La mission de ce projet consiste à planifier le développement du site web, entreprendre une veille technologique, rédiger les spécifications techniques du projet et présenter la solution technique."
    },
  {
    "id": "4",
    "title": "724EVENTS",
    "date": "Décembre 2024",
    "picture": "/images/724event.png",
    "description": "Débugger le site d'une agence d'événementiel",
    "langages": ["Html/Css", "JavaScript", "Sass", "React"],
    "lien": "https://github.com/kahina92-hash/724EVENTS.git",
    "images": [
      "/images/events1.webp",
      "/images/events2.webp",
        "/images/events3.webp"
    ],

 "Compétences_acquises":[ "Déboguer un site web grâce aux Chrome DevTools", "Installer et utiliser React Developer Tools",
  " Écrire et exécuter des tests avec le framework de test Jest","Comprendre les méthodes BDD et TDD"
  ],
    "context":"724events est le site web d'une agence évènementielle qui souhaite publier une nouvelle version de son site vitrine. La mission du projet est d'identifier les problèmes et les bugs, et de les résoudre par la suite en utilisant les compétences acquises en JavaScript, ainsi que des outils spécifiques à React, comme React Developer Tools."
  },
  {
    "id": "5",
    "title": "Nina Carducci",
    "date": "Novembre 2024",
    "picture": "/images/Nina_Carducci.webp",
    "description": "Optimiser le référencement d'un site de photographe",
    "langages": ["Html/Css", "JavaScript", "SEO", "Accessibilite"],
    "lien": "https://github.com/kahina92-hash/Nina-Carducci.git",
    "images": [
      "/images/Nina1.webp",
      "/images/Nina2.webp",
      "/images/Nina3.webp"
    ],
    "Compétences_acquises":[ "Appliquer les techniques de base pour améliorer le SEO d'un site", "Appliquer les règles et les normes de l'accessibilité pour rendre les contenus numériques accessibles à tous",
    " Utilisation des outils tels que Lighthouse et Wave pour auditer la performance d'un site web"
    ],
      "context":"Nina Carducci est un site portfolio d'une photographe. La mission de ce projet est d'optimiser le référencement d'un site, en améliorant sa performance et son accessibilité."
    },
  {
    "id": "6",
    "title": "Booki",
    "date": "Octobre 2024",
    "picture": "/images/booki.webp",
    "description": "Créer la page d'accueil d'une agence de voyage avec HTML & CSS",
    "langages": ["Html/Css", "Figma"],
    "lien": "https://github.com/kahina92-hash/Booki.git",
    "images": [
      "/images/booki1.webp",
      "/images/booki2.webp",
      "/images/booki3.webp"
    ],
    "Compétences_acquises":[ "Comprendre les détails d'une maquette et l'utilisation de Figma", "Comprendre la responsivité et les breakpoints",
    " Utilisation de Grid et Flexbox pour créer des mises en page responsives et flexibles"
    ],
      "context":"Booki est un site Internet qui permet aux usagers de trouver des hébergements et des activités dans la ville de leur choix. La mission principale de ce projet est d'intégrer l'interface responsive d'un site web à partir des maquettes Figma pour mobile, tablette et desktop, ainsi que les images mises à disposition."
    },
  {
    "id": "7",
    "title": "Ohmyfood",
    "date": "Août 2024",
    "picture": "/images/oMyfood.webp",
    "description": "Améliorer l'interface d'un site mobile avec des animations CSS",
    "langages": ["Html/Css", "Sass", "Figma"],
    "lien": "https://github.com/kahina92-hash/ohMyfood.git",
    "images": [
      "/images/ohmyfood1.webp",
      "/images/ohmyfood2.webp",
       "/images/ohmyfood3.webp"
    ],
    "Compétences_acquises":[ " Comprendre Git et GitHub ainsi que le versionnage du projet", "Comprendre et utiliser Sass",
    " Utilisation des transitions et des keyframes pour construire des animations modernes et fluides"
    ],
      "context":"Ohmyfood est un site web qui répertorie les menus de restaurants gastronomiques. La tâche principale de ce projet est d'intégrer une maquette en mobile-first, tout en mettant en œuvre des animations pour enrichir l'expérience utilisateur (UX) du site, en utilisant notamment le préprocesseur Sass.."
    },
  {
    "id": "8",
    "title": "KASA",
    "date": "Juillet 2024",
    "picture": "/images/kasa.webp",
    "description": "Créer une application web de location immobilière avec React",
    "langages": ["React", "JavaScript", "Html/Css"],
    "lien": "https://github.com/kahina92-hash/kasa.git",
    "images": [
      "/images/kasa1.webp",
      "/images/kasa2.webp",
         "/images/kasa3.webp"
    ],
    "Compétences_acquises":[ "Initialiser une application avec CRA", "Configurer la navigation entre les pages de l'application avec React Routere",
    " Développer des éléments de l'interface d'un site web grâce à des composants React","Développer une interface web avec Sass et des animations CSS"
    ],
      "context":"Kasa est un site web de location d'appartements entre particuliers. La mission de ce projet est d'implémenter le front-end d'une application en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive."
    },
  {
    "id": "9",
    "title": "Sophie Bluel",
    "date": "Juin 2024",
    "picture": "/images/Sophie-Buel.webp",
    "description": "Créer une page web dynamique avec JavaScript",
    "langages": ["React", "JavaScript", "Html/Css"],
    "lien": "https://github.com/kahina92-hash/sophie_buel.git",
    "images": [
      "/images/sophie1.webp",
      "/images/sophie2.webp",
      "/images/sophie3.webp"
    ],
    "Compétences_acquises":[ "Gérer les événements utilisateurs avec JavaScript", "Manipuler les éléments du DOM avec JavaScript",
    " Récupérer les données utilisateurs dans JavaScript via des formulaires","Communiquer avec une API pour récupérer et envoyer des données"
    ],
      "context":"Sophie Bluel est un site portfolio d'une architecte d'intérieur. La mission de ce projet est de créer une page web dynamique utilisant JavaScript et en communiquant avec une API."
    }
]
